#ifndef SETTINGS
#define SETTINGS

//-------------------------------------------------------------------
// Настройки поисковой выдачи

// Столбцы поисковой выдачи
#define COL_COUNT         7
#define COL_HEADER        "Category" << "Name" << "Date" << "Size" << "SE" << "LE" << "Magnet"

// Минимум букв для поисковой строки
#define MIN_CHAR_SEARCH   4 

// Файлы конфигурации
#define SERVER_HOSTS_PATH "hosts.ini"


//-------------------------------------------------------------------
// Настройки ожидания соединения с сервером

#define TIME_WAIT_FOR_CONNECT 500000
#define TIME_WAIT_FOR_WRITTEN 200000

//-------------------------------------------------------------------
// Настройки работы в анонимной сети (через прокси-сервер)

// Подключение, отключение работы через прокси (для отключения - закомментировать следующую строку)
//#define PROXY_SERVER
#define PROXY_HOST            "127.0.0.1"
#define PROXY_PORT            9050
#define PROXY_SRV_PATH        "proxy_srv//tor//tor.exe"

//-------------------------------------------------------------------

#endif